{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "name": "conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "batch_input_shape": [null, 224, 224, 3], "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "dtype": "float32", "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "maxpool1", "strides": [1, 1], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "name": "conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "maxpool2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "name": "conv3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "activation": "linear", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "maxpool3", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "hidden1", "activity_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout2"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "hidden2", "activity_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu5", "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "output", "activity_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "softmax", "activation": "softmax"}}], "keras_version": "2.0.4"}