{"keras_version": "2.0.6", "config": [{"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "batch_input_shape": [null, 784], "kernel_constraint": null, "name": "dense_4", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "units": 512, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 512, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "name": "dense_5", "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 10, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "name": "dense_6", "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}