{"config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "dtype": "float32", "filters": 32, "data_format": "channels_last", "batch_input_shape": [null, 1, 28, 28], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv1", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2], "name": "pool1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "conv2", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2], "name": "pool2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "activation": "relu", "name": "fc1", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "activation": "softmax", "name": "fc2", "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential"}