{"config": [{"config": {"strides": [1, 1], "dtype": "float32", "name": "conv1", "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 32, 32, 3], "padding": "same", "trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "pool1", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "name": "conv2", "dilation_rate": [1, 1], "filters": 64, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "pool2", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 64, "name": "fc1", "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 10, "name": "fc2", "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}