{"keras_version": "2.0.6", "config": [{"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "dtype": "float32", "batch_input_shape": [null, 1, 28, 28], "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "padding": "same", "name": "conv1", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "pool1", "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "name": "conv2", "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "padding": "same", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "filters": 64}, "class_name": "Conv2D"}, {"config": {"name": "pool2", "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 64, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "name": "fc1", "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 10, "kernel_regularizer": null, "bias_regularizer": null, "activation": "softmax", "name": "fc2", "trainable": true, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}